Loading settings
Loading model from model_save/lenet/mnist...
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, 28, 28, 1)]       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 28, 28, 6)         156       
_________________________________________________________________
block1_pool1 (MaxPooling2D)  (None, 14, 14, 6)         0         
_________________________________________________________________
drop_1 (Dropout)             (None, 14, 14, 6)         0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 14, 14, 16)        2416      
_________________________________________________________________
block2_pool1 (MaxPooling2D)  (None, 7, 7, 16)          0         
_________________________________________________________________
drop_2 (Dropout)             (None, 7, 7, 16)          0         
_________________________________________________________________
flatten (Flatten)            (None, 784)               0         
_________________________________________________________________
fc1 (Dense)                  (None, 120)               94200     
_________________________________________________________________
fc2 (Dense)                  (None, 84)                10164     
_________________________________________________________________
drop_3 (Dropout)             (None, 84)                0         
_________________________________________________________________
before_softmax (Dense)       (None, 10)                850       
_________________________________________________________________
predictions (Activation)     (None, 10)                0         
=================================================================
Total params: 107,786
Trainable params: 107,786
Non-trainable params: 0
_________________________________________________________________
Dataset: adv
Loading adv examples...
Number of (unique) adv examples:  129
Number of adv examples:  129
Done
Time  4.818096160888672
